package cryptolabs_test

import (
	"github.com/xXxRisingTidexXx/cryptography-labs"
	"testing"
)

func TestMerkleHellman(t *testing.T) {
	testCipher(
		t,
		cryptolabs.NewMerkleHellman([8]rune{2, 7, 11, 21, 42, 89, 180, 354}, 881, 588),
		spec{"", "", ""},
		spec{
			"Володи́мир Кири́лович Ма́лик (справжнє прізвище — Сиченко; 21 лютого 1921, Новосілк" +
				"и — 31 серпня 1998, Лубни).",
			"",
			"΅ƭ΅ї΅Ϣ΅ї΅σ΅ɾӴȓ΅ϟ΅ɾѱħĭ΅ǉ΅ɾѱħ΅ɾӴȓ΅Ϣ΅ї΅˚΅ɾѱϬĭ΅ʲ΅ɢӴȓ΅Ϣ΅ɾ΅˶ĭŉѱȓ΅Ճѱħ΅ɢ΅˚΅л΅Ӌѱʖĭ΅Ճѱħѱ̎΅ԧ΅˚" +
				"΅ɾѱȯ΅үĭԜħʖĭ΅̀΅ɾѱϬ΅ү΅Ӌ΅˶΅їʻĭƳȧĭ΅Ϣѱ̜ѱƟ΅ї΅φ΅їĭȧɃƳȧʪĭ΅Ξ΅ї΅˚΅їѱȓѱ̎΅Ϣ΅˶΅ɾĭԜħʖĭʟȧĭѱȓ΅ү" +
				"ѱħ΅Ճ΅ӋѱЈĭȧɃɃŗʪĭ΅ʵѱʋ΅͎΅Ӌ΅ɾȵ̢",
		},
		spec{"a", "", "ѩ"},
		spec{"Hello, world!", "", "ɬ\u05CAӺӺٞʪĭِٞЃӺӞș"},
		spec{
			"Великий Цезарь, взойдите к престолу!",
			"",
			"΅ƭ΅ү΅Ϣ΅ɾ΅˶΅ɾ΅ͪĭ΅Э΅ү΅ԧ΅ɢѱħѱʤʪĭ΅˚΅ԧ΅ї΅ͪ΅σ΅ɾѱƟ΅үĭ΅˶ĭ΅Ճѱħ΅үѱȓѱƟ΅ї΅Ϣѱʋș",
		},
	)
}
